ecd/app/controllers/building_types_controller.rb

  def index
    @building_types = BuildingType.all
---
SELECT * FROM `building_types`

  def show
    @building_type = BuildingType.find(params[:id])
---
SELECT * FROM `building_types` WHERE (`building_types`.`id` = 0)