ecd/app/controllers/buildings_controller.rb

  def index
    @buildings = Building.all
---
SELECT * FROM `buildings`

  def show
    @building = Building.find(params[:id])
---
SELECT * FROM `buildings` WHERE (`buildings`.`id` = 2)

  def edit
    @building = Building.find(params[:id])
    @buildings = Building.all
---
SELECT * FROM `buildings` WHERE (`buildings`.`id` = 2)
SELECT * FROM `buildings`

  def create
    @building = Building.new(params[:building])

    respond_to do |format|
      if @building.save
---
INSERT INTO `buildings` (`updated_at`, `building_name`, `building_abbrv`, `enabled`, `building_id`, `building_type_id`, `created_at`) VALUES('2010-02-13 23:15:24', NULL, NULL, NULL, NULL, NULL, '2010-02-13 23:15:24')

  def destroy
    @building = Building.find(params[:id])
    @building.destroy
---
SELECT * FROM `buildings` WHERE (`buildings`.`id` = 1)
DELETE FROM `buildings` WHERE `id` = 1