ecd/app/controllers/data_sets_controller.rb

  def index
    @data_sets = DataSet.all
---
SELECT * FROM `data_sets`

  def show
    @data_set = DataSet.find(params[:id])
---
SELECT * FROM `data_sets` WHERE (`data_sets`.`id` = 1)

  def create
    @data_set = DataSet.new(params[:data_set])

    respond_to do |format|
      if @data_set.save
---
INSERT INTO `data_sets` (`name`, `updated_at`, `units`, `point_number`, `meter_id`, `created_at`) VALUES('Energy Consumption', '2010-02-20 22:10:14', 'KWh', 0, 1, '2010-02-20 22:10:14')