ecd/app/controllers/meters_controller.rb

SELECT * FROM `meters`
---
  def index
    @meters = Meter.all

SELECT * FROM `meters`
---
  def refresh
    parse_xml(52, 1)
    Meter.all do |meter|

SELECT * FROM `meters` WHERE (`meters`.`id` = 1)
---
  def show
    @meter = Meter.find(params[:id])

INSERT INTO `meters` (`updated_at`, `building_id_id`, `modbus_address`, `created_at`) VALUES('2010-02-19 06:13:05', 2, 52, '2010-02-19 06:13:05')
---
  def create
    @meter = Meter.new(params[:meter])

    respond_to do |format|
      if @meter.save