ecd/app/controllers/meter_types_controller.rb

  def index
    @meter_types = MeterType.all
---
SELECT * FROM `meter_types`