ecd/app/controllers/series_controller.rb

  def index
    @series = Series.all
---
SELECT * FROM `series`

  def show
    @series = Series.find(params[:id])
---
SELECT * FROM `series` WHERE (`series`.`id` = 0)