ecd/app/controllers/update_meter_controller.rb

  def index
    meters = Meter.all
---
SELECT * FROM `meters`